In [ ]:
import pandas as pd

dates = pd.read_csv('data/dates.csv')
dates.head(3)

In [23]:
movies = pd.read_csv('data/movies.csv')
movies.head(3)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance

In [ ]:
ratings1 = pd.read_csv('data/ratings1.csv')
ratings1.head(3)

In [ ]:
ratings2 = pd.read_csv('data/ratings2.csv')
ratings2.head(3)

In [ ]:
dates.info()

In [5]:
# Сколько уникальных пользователей в таблице ratings1?

ratings1['userId'].nunique()

274

In [ ]:
# В каком году было выставлено больше всего оценок?

dates['date'] = pd.to_datetime(dates['date'])
dates['year'] = dates['date'].dt.year
dates['year'].value_counts()

In [22]:
ratings = pd.concat([ratings1, ratings2])
display(ratings)

       userId  movieId  rating
0           1        1     4.0
1           1        3     4.0
2           1        6     4.0
3           1       47     5.0
4           1       50     5.0
...       ...      ...     ...
60831     610   166534     4.0
60832     610   168248     5.0
60833     610   168250     5.0
60834     610   168252     5.0
60835     610   170875     3.0

[100837 rows x 3 columns]

In [ ]:
ratings = pd.concat(
    [ratings1, ratings2],
    ignore_index=True
)
display(ratings)

In [ ]:
print('Число строк в таблице ratings: ', ratings.shape[0])
print('Число строк в таблице dates: ', dates.shape[0])
print(ratings.shape[0] == dates.shape[0])

In [ ]:
display(ratings1.tail(1))
display(ratings2.head(1))

In [ ]:
ratings = ratings.drop_duplicates(ignore_index=True)
print('Число строк в таблице ratings: ', ratings.shape[0])

In [ ]:
ratings_dates = pd.concat([ratings, dates], axis=1)
display(ratings_dates.tail(7))

In [ ]:
ratings_dates = ratings_dates.drop(['year'], axis=1)
display(ratings_dates.tail(7))

7. Объединение DataFrame: join, merge

In [ ]:
joined_false = ratings_dates.join(
    movies,
    rsuffix='_right',
    how='left'
)
display(joined_false)

In [ ]:
joined_false = ratings_dates.join(
    movies,
    lsuffix='_left',
    how='right'
)
display(joined_false)

In [ ]:
# Чтобы совместить таблицы по ключевому столбцу с помощью метода join(), необходимо использовать ключевой столбец в «правой» таблице в качестве индекса. 
# Это можно сделать с помощью метода set_index(). Также необходимо указать название ключа в параметре on.

joined = ratings_dates.join(
    movies.set_index('movieId'),
    on='movieId',
    how='left'
)
display(joined.head())

In [ ]:
print('Число строк в таблице ratings_dates: ', ratings_dates.shape[0])
print('Число строк в таблице joined: ', joined.shape[0])
print(ratings_dates.shape[0] == joined.shape[0])

МЕТОД ОБЪЕДИНЕНИЯ MERGE

In [ ]:
merged = ratings_dates.merge(
    movies,
    on='movieId',
    how='left'
)
display(merged.head())

In [ ]:
print('Число строк в таблице ratings_dates: ', ratings_dates.shape[0])
print('Число строк в таблице merged: ', merged.shape[0])
print(ratings_dates.shape[0] == merged.shape[0])

In [32]:
merged2 = ratings_dates.merge(
    movies,
    on='movieId',
    how='outer'
)
print('Число строк в таблице merged2: ', merged2.shape[0])
display(merged2.tail())

Число строк в таблице merged2:  100854

,userId,movieId,rating,date,title,genres
100849,NaN,30892,NaN,NaT,In the Realms of the Unreal (2004),Animation|Documentary
100850,NaN,32160,NaN,NaT,Twentieth Century (1934),Comedy
100851,NaN,32371,NaN,NaT,Call Northside 777 (1948),Crime|Drama|Film-Noir
100852,NaN,34482,NaN,NaT,"Browning Version, The (1951)",Drama
100853,NaN,85565,NaN,NaT,Chalet Girl (2011),Comedy|Romance

In [ ]:
merge_ratings = ratings1.merge(ratings2, how='outer')
print('Число строк в таблице merge_ratings: ', merge_ratings.shape[0])
display(merge_ratings)

Задание 7.3

In [41]:
data_1 = pd.DataFrame({'Value': [100, 45, 80],
                       'Group': [1, 4, 5]},
                      index = ['I0', 'I1', 'I2']
                     )
data_2 = pd.DataFrame({'Company': ['Google', 'Amazon', 'Facebook'],
                       'Add': ['S0', 'S1', 'S7']},
                      index = ['I0', 'I1', 'I3']
                     )

In [47]:
display(data_1.merge(data_2, how='inner', right_index=True, left_index=True))

    Value  Group Company Add
I0    100      1  Google  S0
I1     45      4  Amazon  S1

Задание 7.4

In [48]:
a = pd.DataFrame({'A': ['a', 'b', 'c'], 'B': [103, 214, 124], 'C': [1, 4, 2]})
b = pd.DataFrame({'V': ['d', 'b', 'c'], 'U': [1393.7, 9382.2, 1904.5], 'C': [1, 3, 2]})

In [49]:
display(a.merge(b, how='right', on='C'))

     A      B  C  V       U
0    a  103.0  1  d  1393.7
1  NaN    NaN  3  b  9382.2
2    c  124.0  2  c  1904.5

Задание 7.5

In [ ]:
items_df = pd.DataFrame({
'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394], 
'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],
'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]
})

purchase_df = pd.DataFrame({
    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],
    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132], 
    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]
})
"""
Сформируйте DataFrame merged, в котором в результате объединения
purchase_df и items_df останутся модели, которые учтены на складе и имели продажи. 
"""
merged = items_df.merge(purchase_df, on='item_id', how='inner')
display(merged)
"""
Найдите из таблицы merged суммарную выручку, которую можно было бы получить 
от продажи всех товаров, которые есть на складе. 
Результат занесите в переменную income.
"""
merged['total'] = merged['stock_count'] * merged['price']
display(merged)
income = merged['total'].sum()
display(income)

8. Закрепление знаний

In [58]:
ratings_movies = pd.read_csv('data/ratings_movies.csv')
ratings_movies.head()

,Unnamed: 0,userId,movieId,rating,date,title,genres
0,0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance
2,2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller
3,3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

In [57]:
#библиотека для регулярных выражений
import re 
def get_year_release(arg):
    #находим все слова по шаблону "(DDDD)"
    candidates = re.findall(r'\(\d{4}\)', arg) 
    # проверяем число вхождений
    if len(candidates) > 0:
        #если число вхождений больше 0,
	#очищаем строку от знаков "(" и ")"
        year = candidates[0].replace('(', '')
        year = year.replace(')', '')
        return int(year)
    else:
        #если год не указан, возвращаем None
        return None

In [61]:
# Создайте в таблице новый признак year_release, который соответствует году выпуска фильма.
# У скольких фильмов не указан год их выпуска?

ratings_movies['year_release'] = ratings_movies['title'].apply(get_year_release)
ratings_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Unnamed: 0    100836 non-null  int64
 1   userId        100836 non-null  int64
 2   movieId       100836 non-null  int64
 3   rating        100836 non-null  float64
 4   date          100836 non-null  object
 5   title         100836 non-null  object
 6   genres        100836 non-null  object
 7   year_release  100818 non-null  float64
dtypes: float64(2), int64(3), object(3)
memory usage: 6.2+ MB

In [62]:
ratings_movies.head()

,Unnamed: 0,userId,movieId,rating,date,title,genres,year_release
0,0,1,1,4.0,2000-07-30 18:45:03,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995.0
1,1,1,3,4.0,2000-07-30 18:20:47,Grumpier Old Men (1995),Comedy|Romance,1995.0
2,2,1,6,4.0,2000-07-30 18:37:04,Heat (1995),Action|Crime|Thriller,1995.0
3,3,1,47,5.0,2000-07-30 19:03:35,Seven (a.k.a. Se7en) (1995),Mystery|Thriller,1995.0
4,4,1,50,5.0,2000-07-30 18:48:51,"Usual Suspects, The (1995)",Crime|Mystery|Thriller,1995.0

In [ ]:
# Какой фильм, выпущенный в 1999 году, получил наименьшую среднюю оценку зрителей?
# В качестве ответа запишите название этого фильма без указания года его выпуска.

mask = ratings_movies['year_release'] == 1999
ratings_movies[mask]['rating'].min()

In [107]:
rm = ratings_movies[mask]
display(rm)
display(rm.sort_values(by='rating'))

,Unnamed: 0,userId,movieId,rating,date,title,genres,year_release
162,162,1,2502,5.0,2000-07-30 18:21:18,Office Space (1999),Comedy|Crime,1999.0
166,166,1,2571,5.0,2000-07-30 18:31:28,"Matrix, The (1999)",Action|Sci-Fi|Thriller,1999.0
167,167,1,2580,5.0,2000-07-30 18:50:00,Go (1999),Comedy|Crime,1999.0
170,170,1,2617,2.0,2000-07-30 18:43:08,"Mummy, The (1999)",Action|Adventure|Comedy|Fantasy|Horror|Thriller,1999.0
171,171,1,2628,4.0,2000-07-30 18:08:43,Star Wars: Episode I - The Phantom Menace (1999),Action|Adventure|Sci-Fi,1999.0
...,...,...,...,...,...,...,...,...
100090,100090,610,27317,4.0,2016-11-19 08:48:51,Audition (Ôdishon) (1999),Drama|Horror|Mystery|Romance|Thriller,1999.0
100169,100169,610,41712,4.0,2016-11-19 08:53:53,"Room for Romeo Brass, A (1999)",Comedy|Drama,1999.0
100677,100677,610,110281,4.0,2016-11-19 08:00:36,King of Comedy (Hei kek ji wong) (1999),Comedy|Drama|Romance,1999.0
100797,100797,610,145951,0.5,2017-05-03 22:03:39,Bloodsport: The Dark Kumite (1999),Action|Thriller,1999.0
100815,100815,610,158721,3.5,2016-11-19 08:01:31,Gen-X Cops (1999),Action|Comedy|Thriller,1999.0

,Unnamed: 0,userId,movieId,rating,date,title,genres,year_release
68328,68328,442,2881,0.5,2012-03-12 13:55:18,Double Jeopardy (1999),Action|Crime|Drama|Thriller,1999.0
27637,27637,187,2701,0.5,2006-10-26 07:52:48,Wild Wild West (1999),Action|Comedy|Sci-Fi|Western,1999.0
78748,78748,489,2485,0.5,2012-03-31 22:20:12,She's All That (1999),Comedy|Romance,1999.0
20882,20882,138,2707,0.5,2008-09-29 08:13:53,Arlington Road (1999),Thriller,1999.0
21326,21326,140,2683,0.5,2004-01-26 22:01:51,Austin Powers: The Spy Who Shagged Me (1999),Action|Adventure|Comedy,1999.0
...,...,...,...,...,...,...,...,...
23095,23095,157,2959,5.0,2001-06-14 00:51:45,Fight Club (1999),Action|Crime|Drama|Thriller,1999.0
76131,76131,479,2583,5.0,2002-12-08 17:13:36,Cookie's Fortune (1999),Comedy|Drama,1999.0
22970,22970,156,2997,5.0,2005-01-27 19:42:38,Being John Malkovich (1999),Comedy|Drama|Fantasy,1999.0
76136,76136,479,2700,5.0,2002-12-08 17:13:36,"South Park: Bigger, Longer and Uncut (1999)",Animation|Comedy|Musical,1999.0
162,162,1,2502,5.0,2000-07-30 18:21:18,Office Space (1999),Comedy|Crime,1999.0